Revit 2027 API
PDFExportOptions.IsValidNamingRule Method
 Whether naming rule is valid or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidNamingRule(
	IList<TableCellCombinedParameterData> namingRule
)
Public Shared Function IsValidNamingRule (
	namingRule As IList(Of TableCellCombinedParameterData)
) As Boolean
public:
static bool IsValidNamingRule(
	IList<TableCellCombinedParameterData^>^ namingRule
)
static member IsValidNamingRule :
        namingRule : IList<TableCellCombinedParameterData> -> bool
Parameters
namingRule IList<TableCellCombinedParameterData>
 The naming rule to be validated.
Return Value
Boolean
 Whether or not the name is valid.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 If true, this naming rule is a valid. If false, this naming rule is not valid for empty naming rule or illegal characters, such as
\ / : * ? " < >
.
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace